Revit 2024 API
IndependentTag.IsTaggedOnSubelement Method
 Returns true if the any of the tagged references is a subelement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool IsTaggedOnSubelement()
Visual Basic
Public Function IsTaggedOnSubelement As Boolean
Visual C++
public:
bool IsTaggedOnSubelement()
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace